<p>30 января 2014</p>
<ul>
	<li>Проверка кэша по заголовку infrajs-cache:FAIL если кэша нет.</li>
	<li>docx вставка нескольких значений окружения {env:company} {envdiv:contacts}.</li>
	<li>Карта сайта автоматическая, нужно корректно указывать путь в robots.txt на продакшин</li>
	<li>Пройдены все тесты кроме тестов шаблонизатора.</li>
	<li>файл infra/update отмечает заход админа и иницирует обновлние кэша infra-update:OK</li>
	<li>Поправлено возвращение ссылок фукнциями infra_forr и тп. call_user_func_array заменена.</li>
	<li>В json можно использовать {} пустые объекты.</li>
	<li>seo для всех страниц, в том числе для позиций каталога</li>
	<li>Используется репозитарий GIT</li>
</ul>
